vkatsageorgiou/Stellarisware-1/boards/ek-lm3s3748/qs-scope/qs-scope.c
//*****************************************************************************
//
// qs-scope.c - Quickstart Oscilloscope application main source file.
//
// Copyright (c) 2008-2009 Luminary Micro, Inc.  All rights reserved.
// Software License Agreement
// 
// Luminary Micro, Inc. (LMI) is supplying this software for use solely and
// exclusively on LMI's microcontroller products.
// 
// The software is owned by LMI and/or its suppliers, and is protected under
// applicable copyright laws.  All rights are reserved.  You may not combine
// this software with "viral" open-source software in order to form a larger
// program.  Any use in violation of the foregoing restrictions may subject
// the user to criminal sanctions under applicable laws, as well as to civil
// liability for the breach of the terms and conditions of this license.
// 
// THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
// OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
// MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
// LMI SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
// CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 4781 of the EK-LM3S3748 Firmware Package.
//
//*****************************************************************************

//*****************************************************************************
//
//! \addtogroup example_list
//! <h1>Quickstart Oscilloscope (qs-scope)</h1>
//!
//! A two channel oscilloscope implemented using the Stellaris
//! microcontroller's analog-to-digital converter (ADC).  The oscilloscope
//! supports sample rates of up to 1M sample per second and will show the
//! captured waveforms on the color STN display.  On-screen menus provide user
//! control over timebase, channel voltage scale and position, trigger type,
//! trigger level and trigger position.  Other features include the ability
//! to save captured data as comma-separated-value files suitable for use with
//! spreadsheet applications or bitmap images on either an installed microSD
//! card or a USB flash drive.  The board may also be connected to a WindowsXP
//! or Vista host system and controlled remotely using a Windows application.
//!
//! \addtogroup example_list
//! <b>Oscilloscope User Interface</b>
//!
//! All oscilloscope controls and settings are accessed using the navigation
//! control on the board.  This control offers up, down, left, right and select
//! functions in a single unit.  Rocking the control in the desired direction
//! sends ``up'', ``down'', ``left'' or ``right'' messages to the application
//! and pressing on the center sends a ``select'' message.
//!
//! Controls and settings are arranged into groups by function such as display
//! settings, trigger settings, file operations and setup choices.  These
//! groups are accessed by pressing ``select'' to display the main menu.  With
//! the menu displayed, use ``up'' and ``down'' to select between the available
//! groups.  When the desired group is highlighted, press ``select'' once again
//! to dismiss the menu.
//!
//! Controls from the currently selected group are shown in the bottom portion
//! of the application display.  Use ``up'' and ``down'' to cycle through the
//! controls in the group and ``left'' and ``right'' to change the value of, or
//! select the action associated with the control which is currently
//! displayed.
//!
//! The control groups and the individual controls offered by each are
//! outlined below:
//!
//! \verbatim
//!   Group    Control       Setting
//!   -----    -------       -------
//!
//!   Display
//!            Channel 2     ON or OFF.
//!            Timebase      Select values from 2uS to 50mS per division.
//!            Ch1 Scale     Select values from 100mV to 10V per division.
//!            Ch2 Scale     Select values from 100mV to 10V per division.
//!            Ch1 Offset    Press and hold "left" or "right" to move the
//!                          waveform up or down in 100mV increments.
//!            Ch2 Offset    Press and hold "left" or "right" to move the
//!                          waveform up or down in 100mV increments.
//!   Trigger
//!            Trigger       The trigger type - Always, Rising, Falling or
//!                          Level.
//!            Trig Channel  1 or 2 to select the channel used for triggering.
//!            Trig Level    Press and hold "left" or "right" to change the
//!                          trigger level in 100mV increments.
//!            Trig Pos      Press and hold "left" or "right" to move the
//!                          trigger position on the display.
//!            Mode          Running or Stopped.
//!            One Shot      If the current mode is "Stopped", pressing
//!                          "left" or "right" initiates capture and display
//!                          of a single waveform.
//!   Setup
//!            Captions      Select ON to show the timebase and scale
//!                          captions or OFF to remove them from the display.
//!            Voltages      Select ON to show the measured voltages for each
//!                          channel or OFF to remove them from the display.
//!            Grid          Select ON to show the graticule lines or OFF to
//!                          remove them from the display.
//!            Ground        Select ON to show dotted lines corresponding
//!                          to the ground levels for each channel or OFF
//!                          to remove them from the display.
//!            Trig Level    Select ON to show a solid horizontal line
//!                          corresponding to the trigger level for the
//!                          trigger channel or OFF to remove this line from
//!                          the display.
//!            Trig Pos      Select ON to show a solid vertical line at the
//!                          trigger position or OFF to remove this line from
//!                          the display.
//!            Clicks        Select ON to enable sounds on button presses or
//!                          OFF to disable them.
//!            USB Mode      Select Host to operate in USB host mode and
//!                          allow use of flash memory sticks, or Device to
//!                          operate as a USB device and allow connection to
//!                          a host PC system.
//!   File
//!            CSV on SD     Save the current waveform data as a text file
//!                          on an installed microSD card.
//!            CSV on USB    Save the current waveform data as a text file
//!                          on an installed USB flash stick (if in USB host
//!                          mode - see the Setup group above).
//!            BMP on SD     Save the current waveform display as a bitmap
//!                          on an installed microSD card.
//!            BMP on USB    Save the current waveform display as a bitmap
//!                          on an installed USB flash stick (if in USB host
//!                          mode - see the Setup group above).
//!   Help
//!            Help          Pressing "left" or "right" will show or hide the
//!                          screen showing oscilloscope connection help.
//!            Channel 1     Pressing "left" or "right" will cause the scale
//!                          and position for the channel 1 waveform to be set
//!                          such that the waveform is visible on the display.
//!            Channel 2     Pressing "left" or "right" will cause the scale
//!                          and position for the channel 2 waveform to be set
//!                          such that the waveform is visible on the display.
//! \endverbatim
//!
//! \addtogroup example_list
//! <b>Oscilloscope Connections</b>
//!
//! The 8 pins immediately above the color STN display panel offer connections
//! for both channels of the oscilloscope and also two test signals that can be
//! used to provide input in the absence of any other suitable signals.  Each
//! channel input must lie in the range -16.5V to +16.5V relative to the board
//! ground allowing differences of up to 33V to be measured.
//!
//! The connections are as follow where pin 1 is the leftmost pin, nearest the
//! microSD card socket:
//!
//! \verbatim
//!  1    Test 1      A test signal connected to one side of the speaker on
//!                   the board.
//!  2    Channel 1+  This is the positive connection for channel 1 of the
//!                   oscilloscope.
//!  3    Channel 1-  This is the negative connection for channel 1 of the
//!                   oscilloscope.
//!  4    Ground      This is connected to board ground.
//!  5    Test 2      A test signal connected to the board Status LED which
//!                   is driven from PWM0.  This signal is configured to
//!                   provide a 1KHz square wave.
//!  6    Channel 2+  This is the positive connection for channel 2 of the
//!                   oscilloscope.
//!  7    Channel 2-  This is the negative connection for channel 2 of the
//!                   oscilloscope.
//!  8    Ground      This is connected to board ground.
//! \endverbatim
//!
//! \addtogroup example_list
//! <b>Triggering and Sample Rate Notes</b>
//!
//! The oscilloscope can sample at a maximum combined rate of 1M samples
//! per second.  When both channels are enabled, therefore, the maximum
//! sample rate on each channel is 500K samples per second.  For maximum
//! resolution at the lowest timebases (maximum samples rates), disable
//! channel 2 if it is not required.  These sample rates give usable waveform
//! capture for signals up to around 100KHz.
//!
//! Trigger detection is performed in software during ADC interrupt handling.
//! At the highest sampling rates, this interrupt service routine consumes
//! almost all the available CPU cycles when searching for trigger conditions.
//! At these sample rates, if a trigger level is set which does not correspond
//! to a voltage that is ever seen in the trigger channel signal, the user
//! interface response can become sluggish.  To combat this, the oscilloscope
//! will abort any pending waveform capture operation if a key is pressed
//! before the capture cycle as completed.  This prevents the user interface
//! from being locked out and allows the trigger level or type to be changed
//! to values more appropriate for the signal being measured.
//!
//! \addtogroup example_list
//! <b>File Operations</b>
//!
//! Comma-separated-value or bitmap files representing the last waveform
//! captured may be saved to either a microSD card or a USB flash drive.
//! In each case, the files are written to the root directory of the microSD
//! card or flash drive with file names of the form ``scopeXXX.csv'' or
//! ``scopeXXX.bmp'' where ``XXX'' represents the lowest, three digit, decimal
//! number which offers a file name which does not already exist on the
//! device.
//!
//! \addtogroup example_list
//! <b>Companion Application</b>
//!
//! A companion application, LMScope, which runs on WindowsXP and Vista PCs
//! and the required device driver installer are available on the software CD
//! and via download from the Luminary Micro web site at
//! http://www.luminarymicro.com/products/software_updates.html.  This
//! application offers full control of the oscilloscope from the PC and allows
//! waveform display and save to local hard disk.
//
//*****************************************************************************

#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/adc.h"
#include "driverlib/debug.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/pwm.h"
#include "driverlib/rom.h"
#include "driverlib/sysctl.h"
#include "driverlib/systick.h"
#include "driverlib/timer.h"
#include "driverlib/udma.h"
#include "grlib/grlib.h"
#include "usblib/usblib.h"
#include "utils/uartstdio.h"
#include "drivers/buttons.h"
#include "drivers/class-d.h"
#include "commands.h"
#include "data-acq.h"
#include "file.h"
#include "menu.h"
#include "menu-controls.h"
#include "qs-scope.h"
#include "renderer.h"
#include "usb_device.h"
#include "usb_host.h"
#include "usb_protocol.h"

//*****************************************************************************
//
// Handle for stdio-style debug output via UART0
//
//*****************************************************************************
int g_hStdio;

//*****************************************************************************
//
// Main loop command flags.
//
//*****************************************************************************
unsigned long g_ulCommand;

//*****************************************************************************
//
// System tick counter.
//
//*****************************************************************************
volatile unsigned long g_ulSysTickCounter;
unsigned long g_ulCaptureTick;

//*****************************************************************************
//
// Flag indicating whether or not the connection help screen is currently being
// displayed.
//
//*****************************************************************************
tBoolean g_bShowingHelp = false;

//*****************************************************************************
//
// Flag indicating whether we are capturing oscilloscope data continuously
// or operating in one-shot mode.
//
//*****************************************************************************
tBoolean g_bContinuousCapture = true;

//*****************************************************************************
//
// Flag indicating whether we are waiting for a capture request to complete.
//
//*****************************************************************************
tBoolean g_bCapturePending = false;

//*****************************************************************************
//
// Flag indicating whether we are operating as a USB device or host.
//
//*****************************************************************************
tBoolean g_bUSBModeIsHost = false;

//*****************************************************************************
//
// Flag indicating whether we are to send the next captured waveform data set
// back to the USB host.  This will be the case if the host requested capture
// but has not enabled automatic sending of data.
//
//*****************************************************************************
tBoolean g_bSendData = false;

//*****************************************************************************
//
// Oscilloscope capture buffers
//
//*****************************************************************************
unsigned short g_usScopeData[MAX_SAMPLES_PER_TRIGGER];

//*****************************************************************************
//
// Channels we will display
//
//*****************************************************************************
tBoolean g_pbActiveChannels[2] =
{
    true,
    true
};

//*****************************************************************************
//
// Prototypes for command handling functions.
//
//*****************************************************************************
tBoolean ChangeTimebase(unsigned long ulParam);
tBoolean Channel2Display(unsigned long ulParam);
tBoolean ProcessSysTick(unsigned long ulParam);
tBoolean InitiateCapture(unsigned long ulParam);
tBoolean StartCapture(unsigned long ulParam);
tBoolean StopCapture(unsigned long ulParam);
tBoolean ChangeTrigger(unsigned long ulParam);
tBoolean ChangeTriggerLevel(unsigned long ulParam);
tBoolean ChangeTriggerPos(unsigned long ulParam);
tBoolean ChangeChannel1Scale(unsigned long ulParam);
tBoolean ChangeChannel2Scale(unsigned long ulParam);
tBoolean ChangeChannel1Pos(unsigned long ulParam);
tBoolean ChangeChannel2Pos(unsigned long ulParam);
tBoolean SaveFile(unsigned long ulParam);
tBoolean RetransmitData(unsigned long ulParam);
tBoolean ChangeTriggerChannel(unsigned long ulParam);
tBoolean USBHostConnected(unsigned long ulParam);
tBoolean USBHostDisconnected(unsigned long ulParam);
tBoolean FindChannel(unsigned long ulParam);
tBoolean USBSetMode(unsigned long ulParam);
tBoolean ShowHelpScreen(unsigned long ulParam);

//*****************************************************************************
//
// Command handler function pointer type.
//
//*****************************************************************************
typedef tBoolean (*pfnCommandHandler)(unsigned long);

//*****************************************************************************
//
// Command handler control structure.
//
//*****************************************************************************
typedef struct
{
    //
    // If true, this command handler will be called while a waveform capture
    // is ongoing.  If false, it will be deferred until the capture completes.
    //
    tBoolean bSafeDuringCapture;

    //
    // If true, a debug trace message is output when the command is dispatched
    // to its handler.  If false, the trace message is suppressed.
    //
    tBoolean bTrace;

    //
    // Pointer to the handler for this command.
    //
    pfnCommandHandler pfnHandler;

    //
    // A description string that will be output in the trace message when
    // the command is dispatched.
    //
    const char *pcDesc;
}
tCommandHandler;

//*****************************************************************************
//
// Main loop command handling functions.  The index into this table must be
// equivalent to the bit position used to identify the command in g_ulCommands.
//
//*****************************************************************************
const tCommandHandler g_psCommandHandlers[NUM_SCOPE_COMMANDS] =
{
    { false, true,  ChangeTimebase,       "CHANGE_TIMEBASE" },
    { true,  false, ProcessSysTick,       "SYSTICK" },
    { true,  true,  ChangeTrigger,        "CHANGE_TRIGGER" },
    { false, true,  Channel2Display,      "CH2_DISPLAY" },
    { false, true,  InitiateCapture,      "CAPTURE" },
    { true,  true,  StopCapture,          "STOP" },
    { false, true,  StartCapture,         "START" },
    { true,  true,  ChangeTriggerLevel,   "TRIGGER_LEVEL" },
    { true,  true,  ChangeTriggerPos,     "TRIGGER_POS" },
    { true,  true,  ChangeChannel1Scale,  "CH1_SCALE" },
    { true,  true,  ChangeChannel2Scale,  "CH2_SCALE" },
    { true,  true,  ChangeChannel1Pos,    "CH1_POS" },
    { true,  true,  ChangeChannel2Pos,    "CH2_POS" },
    { false, true,  SaveFile,             "SAVE" },
    { false, true,  RetransmitData,       "RETRANSMIT" },
    { false, true,  ChangeTriggerChannel, "SET_TRIGGER_CH" },
    { true,  true,  USBHostConnected,     "USB_HOST_CONNECT" },
    { true,  true,  USBHostDisconnected,  "USB_HOST_REMOVE" },
    { false, true,  FindChannel,          "FIND" },
    { true,  true,  ShowHelpScreen,       "SHOW_HELP" },
    { false, true,  USBSetMode,           "USB_SET_MODE" }
};

//*****************************************************************************
//
// An array holding a single unsigned long parameter for each of the commands
// described in the g_psCommandHandlers array.
//
//*****************************************************************************
unsigned long g_ulCommandParam[NUM_SCOPE_COMMANDS];

//*****************************************************************************
//
// The control table used by the uDMA controller.  This table must be aligned
// to a 1024 byte boundary.  In this application uDMA is only used for USB,
// so only the first 6 channels are needed.
//
//*****************************************************************************
#if defined(ewarm)
#pragma data_alignment=1024
tDMAControlTable g_sDMAControlTable[6];
#else
tDMAControlTable g_sDMAControlTable[6] __attribute__ ((aligned(1024)));
#endif

//*****************************************************************************
//
// The error routine that is called if any ASSERT fails.
//
//*****************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, unsigned long ulLine)
{
    UARTprintf("Assertion failed in %s:%d\n", pcFilename, ulLine);
    UARTprintf("Runtime error during test\n");
    while(1)
    {
    }
}
#endif

//*****************************************************************************
//
// Handle the system tick interrupt.
//
//*****************************************************************************
void
SysTickIntHandler(void)
{
    //
    // Update our tick counter
    //
    g_ulSysTickCounter++;

    //
    // Set a flag for the main loop to tell it that another tick occurred.
    //
    COMMAND_FLAG_WRITE(SCOPE_SYSTICK, 0);
}

//*****************************************************************************
//
// This function is called from the main loop each time the system tick is
// signalled.  It polls the current state of the buttons and performs any
// actions necessary as a result.
//
// Returns \b true to indicate that a display update is required or \b false
// otherwise.
//
//*****************************************************************************
tBoolean
ProcessSysTick(unsigned long ulParam)
{
    unsigned char ucButtons;
    unsigned char ucChanged;
    unsigned char ucRepeat;
    tBoolean bRetcode;

    //
    // Pass the 10mS tick on to the file system.
    //
    FileTickHandler();

    //
    // Also pass the tick on to the USB host stack if we are in host mode.
    //
    if(g_bUSBModeIsHost)
    {
        ScopeUSBHostTick();
    }

    //
    // Determine the state of the pushbuttons.
    //
    ucButtons = ButtonsPoll(&ucChanged, &ucRepeat);

    //
    // If any button changed state or if we see any autorepeat messages,
    // call the menu to process the key.
    //
    if(ucChanged || ucRepeat)
    {
        bRetcode = MenuProcess(ucButtons, ucChanged, ucRepeat);

        //
        // If the menu indicated that it was dismissed and we are
        // currently showing the help screen, send ourselves a message
        // telling us to refresh the display.
        //
        if(g_bShowingHelp && bRetcode)
        {
            RendererDrawHelpScreen(true);
        }

        return(bRetcode);
    }

    //
    // Update our capture tick counter.
    //
    g_ulCaptureTick++;

    //
    // We didn't have anything to process so no display update can be needed.
    //
    return(false);
}

//*****************************************************************************
//
// Enable PWM0 to provide a 1KHz square wave on the TEST2 output (which also
// happens to be connected to a LED on the board).
//
//*****************************************************************************
void
TestSignalInit(void)
{
    //
    // Enable the PWM peripheral.
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_PWM);

    //
    // Enable the PWM0 output pin.
    //
    GPIOPinTypePWM(GPIO_PORTF_BASE, GPIO_PIN_0);

