vkatsageorgiou/Stellarisware-1/boards/ek-lm3s3748/qs-scope/qs-scope.c
    //
    // Set the PWM up for 1KHz, 50% duty cycle output
    //
    ROM_PWMGenConfigure(PWM_BASE, PWM_GEN_0, (PWM_GEN_MODE_DOWN |
                        PWM_GEN_MODE_DBG_RUN | PWM_GEN_MODE_NO_SYNC));
    ROM_PWMGenPeriodSet(PWM_BASE, PWM_GEN_0, (ROM_SysCtlClockGet() / 1000));
    ROM_PWMPulseWidthSet(PWM_BASE, PWM_OUT_0, (ROM_SysCtlClockGet() / 2000));

    //
    // Start the output running.
    //
    ROM_PWMGenEnable(PWM_BASE, PWM_GEN_0);
    ROM_PWMOutputState(PWM_BASE, PWM_OUT_0_BIT, true);
}

//*****************************************************************************
//
// Once a capture has completed, retrieve information on the samples collected
// and render them to the display.
//
//*****************************************************************************
void
UpdateWaveform(tBoolean bMenuShown, tBoolean bHelpShown, tBoolean bNewData)
{
    tBoolean bOverflow;
    tBoolean bUnderflow;
    tBoolean bRetcode;
    tDataAcqCaptureStatus sStatus;
    unsigned short usTrigLevel;
    unsigned long ulTrigPos;
    tTriggerType eTrigType;

    //
    // Get more thorough information on the capture status.
    //
    bRetcode = DataAcquisitionGetStatus(&sStatus);
    if(!bRetcode)
    {
        UARTprintf("Error reading status!\n");
        return;
    }

    //
    // If the capture was aborted, don't render the new data, merely redisplay
    // what we currently have.
    //
    if(sStatus.eState != DATA_ACQ_ERROR)
    {
        //
        // Check to see if any errors were reported.  If so, the data is likely
        // to be corrupt so don't render it.
        //
        bRetcode = DataAcquisitionDidErrorOccur(true, &bOverflow,
                                                &bUnderflow);

        if(!bRetcode)
        {
            //
            // Get the current trigger information.
            //
            DataAcquisitionGetTrigger(&eTrigType, &ulTrigPos, &usTrigLevel);

            //
            // Display the waveform or waveforms contained in the data set.
            //
            RendererDrawWaveform(&sStatus, &g_sRender, g_pbActiveChannels,
                                 &g_sMeasure);

            //
            // Send the newly captured data back to the USB host if it
            // is connected and has requested it.
            //
            if(bNewData || g_bSendData)
            {
                //
                // Make sure we are currently operating as a USB device.
                //
                if(!g_bUSBModeIsHost)
                {
                    //
                    // We are a device so send the data.
                    //
                    ScopeUSBDeviceSendData(&sStatus, !g_bSendData);
                }

                //
                // Data has been sent (or discarded if we are a USB host) so
                // clear the flag telling us to send it.
                //
                g_bSendData = false;
            }
        }
    }

    //
    // Flush all drawing we have done to the display if we are not currently
    // displaying the menu.
    //
    if(!bMenuShown)
    {
        //
        // If the help screen is not visible, update the waveform normally.
        //
        if(!bHelpShown)
        {
            //
            // Update the waveform display as normal.
            //
            RendererUpdate();
        }
        else
        {
            //
            // The help screen is visible so we only update the alert box,
            // taking care to refresh the help screen when the alert exits.
            //
            RendererUpdateAlert();
        }
    }
}

//*****************************************************************************
//
// Sets default values for various oscilloscope parameters.
//
// This function is called during application initialization to set default
// values for several oscilloscope parameters.
//
// \return None.
//
//*****************************************************************************
void
SetDefaultParameters(void)
{
    g_ulCommandParam[SCOPE_CHANGE_TIMEBASE] = DEFAULT_TIMEBASE_US;
    g_ulCommandParam[SCOPE_CHANGE_TRIGGER] = (unsigned long)TRIGGER_ALWAYS;
    g_ulCommandParam[SCOPE_CH2_DISPLAY] = g_pbActiveChannels[CHANNEL_2];
    g_ulCommandParam[SCOPE_TRIGGER_LEVEL] = DEFAULT_TRIGGER_LEVEL_MV;
    g_ulCommandParam[SCOPE_CH1_SCALE] = DEFAULT_SCALE_MV;
    g_ulCommandParam[SCOPE_CH2_SCALE] = DEFAULT_SCALE_MV;
    g_ulCommandParam[SCOPE_SET_TRIGGER_CH] = CHANNEL_1;
    g_ulCommandParam[SCOPE_SET_USB_MODE] = (unsigned long)g_bUSBModeIsHost;
    g_ulCommandParam[SCOPE_SHOW_HELP] = (unsigned long)g_bShowingHelp;
}

//*****************************************************************************
//
// Handles all commands sent to the main loop.
//
// \param bCapturePending indicates whether or not we are waiting for a
// capture to complete.  Some commands may need to defer operation until the
// pending capture has completed and this flag allows this.
//
// This function is called from the main loop to process any commands sent to
// it asynchronously or which require the previous capture request to have
// been completed before they can be processed.  It checks for bits set in the
// global command flags variable g_ulCommand and dispatches each command
// to the appropriate handler.
//
// \return Returns \b true if any command indicated that a display update
// is required or \b false if no display update is needed.
//
//*****************************************************************************
tBoolean
ProcessCommands(tBoolean bCapturePending)
{
    unsigned long ulLoop;
    tBoolean bRetcode;
    tBoolean bRedrawNeeded;
    tBoolean bCommandHandled;

    //
    // We assume no redraw is required unless we are later told otherwise.
    //
    bRedrawNeeded = false;

    //
    // Remember that we have not handled any commands yet.
    //
    bCommandHandled = false;

    //
    // Check to see if the user has entered any commands via UART and,
    // if so, process the next one.
    //
    CommandReadAndProcess();

    //
    // Loop through each of the command bits in the global command flags
    // variable looking for any that are set.
    //
    for(ulLoop = 0; ulLoop < NUM_SCOPE_COMMANDS; ulLoop++)
    {
        //
        // If a bit is set, we have something to do.
        //
        if(g_ulCommand & SCOPE_CMD_TO_FLAG(ulLoop))
        {
            //
            // Can this command be processed in the current state?
            //
            if(g_psCommandHandlers[ulLoop].bSafeDuringCapture ||
               !bCapturePending)
            {
                //
                // First we clear the bit since we are about to process it.
                //
                COMMAND_FLAG_CLEAR(ulLoop);

                //
                // Does this command have a handler installed?
                //
                if(g_psCommandHandlers[ulLoop].pfnHandler)
                {
                    //
                    // Remember that we did something if it is something
                    // other than handling the system tick.
                    //
                    if(ulLoop != SCOPE_SYSTICK)
                    {
                        bCommandHandled = true;
                    }

                    //
                    // Dump a trace message to the UART unless this is
                    // a high frequency command like SYSTICK.
                    //
                    if(g_psCommandHandlers[ulLoop].bTrace)
                    {
                        UARTprintf("Processing %s %d\n",
                                   g_psCommandHandlers[ulLoop].pcDesc,
                                   g_ulCommandParam[ulLoop]);
                    }

                    //
                    // Call the handler and pass the parameter supplied by
                    // the code that set the command flag in the first place.
                    //
                    bRetcode = (g_psCommandHandlers[ulLoop].pfnHandler)(
                                    g_ulCommandParam[ulLoop]);
                    if(bRetcode)
                    {
                        bRedrawNeeded = true;
                    }
                }
            }
        }
    }

    //
    // If we did anything, call the menu and have it refresh the current
    // display just in case the command came in from UART or USB and it
    // altered the control which currently has the focus.
    //
    if(bCommandHandled)
    {
        MenuRefresh();
    }

    return(bRedrawNeeded);
}

//*****************************************************************************
//
// Performs all capture and display configuration changes required as a result
// of a user request to change the timebase.
//
// \param ulTimebase is the requested timebase expressed in microseconds per
// division.
//
// This function is called from the main command processor to perform
// capture rate updates and one-off display calculations as a result of a
// change in the requested display timebase.
//
// The function calculates the best capture rate to use for the requested
// timebase and also determines the new display horizontal offset to put
// the trigger point at the center of the screen.
//
// This function is also called when the user decides to enable or disable
// the second channel since, when only 1 channel is running, we are able to
// chose the highest sample rate and, hence, provide higher resolution at
// small timebases.
//
// \return Returns \b true if a display redraw is required, \b false
// otherwise.
//
//*****************************************************************************
tBoolean
ChangeTimebase(unsigned long ulTimebase)
{
    unsigned long ulCaptureTime;
    unsigned long ulRate;

    //
    // Determine the best sample rate to use to support the requested
    // timebase.  The sample rate is chosen to ensure that we capture at least
    // twice as many samples as will fit across the display while still
    // staying within our MAX_SAMPLES_PER_TRIGGER buffer size.
    //

    //
    // With the new timebase, how much time do we have to capture the data?
    // This calculation returns ulCaptureTime in microseconds.
    //
    ulCaptureTime = ((2 * WAVEFORM_WIDTH * ulTimebase) /
                     GRATICULE_SIDE);

    //
    // We want to pick the highest capture rate we can use which provides us
    // with no more than MAX_SAMPLES_PER_TRIGGER samples within the capture
    // time just calculated.  We must remember that we may be capturing two
    // samples per sample period if both channels are enabled.
    //
    // This calculation yields the exact rate (in Hz) required to fill the
    // buffer with samples in the time calculated above.
    //
    ulRate = (MAX_SAMPLES_PER_TRIGGER * 1000000) / ulCaptureTime;

    //
    // If we are using both channels, we need to half the requested rate
    // to compensate for the fact that there are 2 samples gathered per
    // period.  This will allow us to fill the capture buffer in the same
    // time.
    //
    if(g_pbActiveChannels[CHANNEL_2])
    {
        ulRate /= 2;
    }

    //
    // Now that we have the rate that we would like to use, we need to convert
    // it to something that is supported by the data acquisition module.  If we
    // don't find an exact match, we pick the next lower supported rate.
    //
    ulRate = DataAcquisitionGetClosestRate(ulRate,
                                           g_pbActiveChannels[CHANNEL_2]);

    UARTprintf("Setting rate %dHz for timebase %duS/div\n", ulRate,
               ulTimebase);

    //
    // Set the new capture rate.
    //
    g_sRender.uluSPerDivision = ulTimebase;
    DataAcquisitionSetRate(ulRate, g_pbActiveChannels[CHANNEL_2]);

    //
    // Inform the USB host (if connected) that the timebase has changed.
    //
    ScopeUSBDeviceSendPacket(SCOPE_PKT_TIMEBASE_UPDATED, 0, ulTimebase);

    //
    // Tell the caller to update the current display
    //
    return(true);
}

//*****************************************************************************
//
// Enables or disables capture and display of oscilloscope channel 2.
//
// This function is called from the main command processor when the user
// wishes to change the state of oscilloscope channel 2.  It sets the global
// variable which determines whether the second channel is displayed or not
// and recalculates the sample capture rate since this may need to be changed
// if a low timebase is in use.
//
// \return Returns \b true if a display update is requried, \b false if not.
//
//*****************************************************************************
tBoolean
Channel2Display(unsigned long ulParam)
{
    tBoolean bTriggerCh1;
    tTriggerType eType;
    unsigned long ulTrigPos;
    unsigned short usLevel;

    //
    // Which channel are we currently triggering on and what trigger
    // parameters are currently in use?
    //
    bTriggerCh1 = DataAcquisitionGetTriggerChannel();
    DataAcquisitionGetTrigger(&eType, &ulTrigPos, &usLevel);

    //
    // If we are disabling channel 2 while it is set to trigger, we need to
    // change the trigger mode to TRIGGER_ALWAYS and revert to triggering on
    // channel 1.
    //
    if((ulParam == false) && !bTriggerCh1)
    {
        ChangeTrigger(TRIGGER_ALWAYS);
        ChangeTriggerChannel(CHANNEL_1);
        RendererSetAlert("Trigger\ndisabled.", 200);
    }

    //
    // Set the variable that tells us whether to display both channels or
    // only one.
    //
    g_pbActiveChannels[CHANNEL_2] = ulParam ? true : false;

    //
    // Inform the USB host (if connected) that channel 2 has been enabled
    // or disabled.
    //
    ScopeUSBDeviceSendPacket(SCOPE_PKT_CHANNEL2, (ulParam ?
                             SCOPE_CHANNEL2_ENABLE : SCOPE_CHANNEL2_DISABLE),
                             0);

    //
    // Turning channel 2 on or off has an effect on the capture rates we can
    // support so recalculate based on the new setting.
    //
    return(ChangeTimebase(g_sRender.uluSPerDivision));
}

//*****************************************************************************
//
// Requests capture of a single set of samples from the data acquisition
// module.
//
// This function is called from the main command processor when the user
// requests to capture a single set of samples.
//
// \return Returns \b true if a display update is requried, \b false if not.
//
//*****************************************************************************
tBoolean
InitiateCapture(unsigned long ulParam)
{
    tTriggerType eType;
    unsigned long ulTrigPos;
    unsigned short usTrigLevel;

    //
    // Get the current trigger type.  We will have changed this to
    // TRIGGER_ALWAYS during StopCapture() so we need to revert to the
    // original trigger when we restart.
    //
    DataAcquisitionGetTrigger(&eType, &ulTrigPos, &usTrigLevel);
    DataAcquisitionSetTrigger(
                          (tTriggerType)g_ulCommandParam[SCOPE_CHANGE_TRIGGER],
                          ulTrigPos, usTrigLevel);

    //
    // Display a message telling the user we are waiting for a trigger.
    //
    RendererSetAlert("Waiting for trigger", 0);

    //
    // Request another triggered capture from the data acquisition module.
    //
    DataAcquisitionRequestCapture();
    g_bCapturePending = true;
    g_bSendData = true;

    return(false);
}

//*****************************************************************************
//
// Stops continuous capture.
//
// This function is called from the main command processor when the user
// requests to stop continuous capture of oscilloscope data.  Stopping is
// achieved by forcing the data acquisition module to trigger immediately.
// This results in us receiving one complete set of valid samples regardless
// of whether or not a trigger was actually requested.  If we were to stop
// merely by cancelling the outstanding acquisition request, we would end up
// with a partial data set which would not look good on the display.
//
// \return Returns \b true if a display update is requried, \b false if not.
//
//*****************************************************************************
tBoolean
StopCapture(unsigned long ulParam)
{
    tTriggerType eType;
    unsigned long ulTrigPos;
    unsigned short usTrigLevel;

    //
    // We stop continuous capture by setting the trigger mode to
    // TRIGGER_ALWAYS.  This ensures that we end up with a complete set of
    // samples and allows the display to be redrawn cleanly.
    //
    DataAcquisitionGetTrigger(&eType, &ulTrigPos, &usTrigLevel);
    DataAcquisitionSetTrigger(TRIGGER_ALWAYS, ulTrigPos, usTrigLevel);

    //
    // Tell the main loop not to continue capture.
    //
    g_bContinuousCapture = false;

    //
    // Inform the USB host (if connected) that automatic capture has stopped.
    //
    ScopeUSBDeviceSendPacket(SCOPE_PKT_STOPPED, 0, 0);

    //
    // No display updated is needed.
    //
    return(false);
}

//*****************************************************************************
//
// Starts continuous capture.
//
// This function is called from the main command processor when the user
// requests to start continuous capture of oscilloscope data.  We set the
// trigger mode correctly and set the global variable \e g_bContinuousCapture
// to tell the main loop to start capturing data again.
//
// \return Returns \b true if a display update is requried, \b false if not.
//
//*****************************************************************************
tBoolean
StartCapture(unsigned long ulParam)
{
    tTriggerType eType;
    unsigned long ulTrigPos;
    unsigned short usTrigLevel;

    //
    // Get the current trigger type.  We will have changed this to
    // TRIGGER_ALWAYS during StopCapture() so we need to revert to the
    // original trigger when we restart.
    //
    DataAcquisitionGetTrigger(&eType, &ulTrigPos, &usTrigLevel);
    DataAcquisitionSetTrigger(
                        (tTriggerType)g_ulCommandParam[SCOPE_CHANGE_TRIGGER],
                        ulTrigPos, usTrigLevel);

    //
    // Tell the main loop that we want to perform continuous capture once
    // again.
    //
    g_bContinuousCapture = true;

    //
    // Inform the USB host (if connected) that automatic capture has stopped.
    //
    ScopeUSBDeviceSendPacket(SCOPE_PKT_STARTED, 0, 0);

    //
    // No display update is needed.
    //
    return(false);
}

//*****************************************************************************
//
// Changes the current trigger type.
//
// \param ulTrigger is the requested trigger type.  This value is a member
// of the enumerated type \e tTriggerType cast to an unsigned long purely
// since this is a standard command processor function.
//
// This function is called from the main command processor when the user
// wishes to change the trigger type.
//
// \return Returns \b true if a display update is requried, \b false if not.
//
//*****************************************************************************
tBoolean
ChangeTrigger(unsigned long ulTrigger)
{
    tBoolean bRetcode;
    tTriggerType eType;
    unsigned long ulTrigPos;
    unsigned short usLevel;
    unsigned long ulTrigType;
    tBoolean bTriggerCh1;

    //
    // Get the existing trigger parameters.
    //
    DataAcquisitionGetTrigger(&eType, &ulTrigPos, &usLevel);
    bTriggerCh1 = DataAcquisitionGetTriggerChannel();

    //
    // Update with the new trigger type.
    //
    bRetcode = DataAcquisitionSetTrigger((tTriggerType)ulTrigger, ulTrigPos,
                                         usLevel);
    if(!bRetcode)
    {
        UARTprintf("Error setting trigger type %d\n", ulTrigger);
    }
    else
    {
        UARTprintf("Set trigger type %d\n", ulTrigger);
    }

    //
    // Map from the internal trigger type enum to the values used in the
    // USB protocol.
    //
    switch(ulTrigger)
    {
        case TRIGGER_RISING:
        {
            ulTrigType = SCOPE_TRIGGER_TYPE_RISING;
            break;
        }

        case TRIGGER_FALLING:
        {
            ulTrigType = SCOPE_TRIGGER_TYPE_FALLING;
            break;
        }

        case TRIGGER_LEVEL:
        {
            ulTrigType = SCOPE_TRIGGER_TYPE_LEVEL;
            break;
        }

        case TRIGGER_ALWAYS:
        default:
        {
            ulTrigType = SCOPE_TRIGGER_TYPE_ALWAYS;
            break;
        }
    }

    //
    // Inform the USB host (if connected) that the trigger type has changed.
    //
    ScopeUSBDeviceSendPacket(SCOPE_PKT_TRIGGER_TYPE, (bTriggerCh1 ?
                             SCOPE_CHANNEL_1 : SCOPE_CHANNEL_2), ulTrigType);

    //
    // No display update is needed
    //
    return(false);
}

//*****************************************************************************
//
// Changes the current trigger level.
//
// \param ulLevel is the requested trigger level expressed as a signed number
// of millivolts.
//
// This function is called from the main command processor when the user
// wishes to change the trigger level.
//
// \return Returns \b true if a display update is requried, \b false if not.
//
//*****************************************************************************
tBoolean
ChangeTriggerLevel(unsigned long ulLevel)
{
    tBoolean bRetcode;
    tTriggerType eType;
    unsigned long ulTrigPos;
    unsigned short usLevel;

    //
    // Get the existing trigger parameters.
    //
    DataAcquisitionGetTrigger(&eType, &ulTrigPos, &usLevel);

    //
    // Update with the new trigger type.
    //
    bRetcode = DataAcquisitionSetTrigger(eType, ulTrigPos,
                             (unsigned short)MV_TO_ADC_SAMPLE((long)ulLevel));
    if(!bRetcode)
    {
        UARTprintf("Error setting trigger level %dmV\n", ulLevel);
    }

    //
    // Update the rendering parameters with the new trigger level.
    //
    g_sRender.lTriggerLevelmV = (long)ulLevel;

    //
    // Inform the USB host (if connected) that the trigger level has
    // changed.
    //
    ScopeUSBDeviceSendPacket(SCOPE_PKT_TRIGGER_LEVEL, 0, ulLevel);

    //
    // A display update is needed.
    //
    return(true);
}

//*****************************************************************************
//
// Changes the current trigger position on the display.
//
// \param ulPos is the requested trigger position expressed in pixels from
// the center of the waveform display area.  This is a signed value cast to
// an unsigned long to conform to the standard command processor function
// prototype.
//
// This function is called from the main command processor when the user
// wishes to change the trigger position.  Note that we don't actually change
// the trigger position as far as the data acquisition is concerned, we
// merely move the display left or right to show the data before or after
// the existing trigger (which is in the center of the data set).
//
// \return Returns \b true if a display update is requried, \b false if not.
//
//*****************************************************************************
tBoolean
ChangeTriggerPos(unsigned long ulPos)
{
    long lPos;

