vkatsageorgiou/Stellarisware-1/boards/ek-lm3s3748/qs-scope/qs-scope.c
    //
    // Set the new offset if we were passed a valid number.
    //
    lPos = (long)ulPos;
    if((lPos > (WAVEFORM_WIDTH / 2)) || (lPos < -(WAVEFORM_WIDTH / 2)))
    {
        UARTprintf("Invalid trigger position %d.\n", lPos);
    }
    else
    {
        //
        // Update the global offset.  This will take effect on the next redraw.
        //
        g_sRender.lHorizontalOffset = lPos;
    }

    //
    // Pass the new position back to the USB host, if connected.
    //
    ScopeUSBDeviceSendPacket(SCOPE_PKT_TRIGGER_POS, 0, lPos);

    //
    // A display update is needed.
    //
    return(true);
}

//*****************************************************************************
//
// Changes the vertical scaling (mV/division) for channel 1.
//
// \param ulScale is the desired vertical scaling for channel 1 expressed
// in millivolts per division.
//
// This function is called from the main command processor when the user
// wishes to change the scaling for channel 1.
//
// \return Returns \b true if a display update is required, \b false if not.
//
//*****************************************************************************
tBoolean
ChangeChannel1Scale(unsigned long ulScale)
{
    //
    // Update the global scaling information.
    //
    g_sRender.ulmVPerDivision[CHANNEL_1] = ulScale;

    //
    // Pass the new scale back to the USB host, if connected.
    //
    ScopeUSBDeviceSendPacket(SCOPE_PKT_SCALE, SCOPE_CHANNEL_1, ulScale);

    //
    // A display update is needed.
    //
    return(true);
}

//*****************************************************************************
//
// Changes the vertical scaling (mV/division) for channel 2.
//
// \param ulScale is the desired vertical scaling for channel 2 expressed
// in millivolts per division.
//
// This function is called from the main command processor when the user
// wishes to change the scaling for channel 2.
//
// \return Returns \b true if a display update is required, \b false if not.
//
//*****************************************************************************
tBoolean
ChangeChannel2Scale(unsigned long ulScale)
{
    //
    // Update the global scaling information.
    //
    g_sRender.ulmVPerDivision[CHANNEL_2] = ulScale;

    //
    // Pass the new scale back to the USB host, if connected.
    //
    ScopeUSBDeviceSendPacket(SCOPE_PKT_SCALE, SCOPE_CHANNEL_2, ulScale);

    //
    // A display update is needed.
    //
    return(true);
}

//*****************************************************************************
//
// Changes the vertical offset (mV) for channel 1.
//
// \param ulScale is the desired vertical scaling for channel 1 expressed
// in millivolts.
//
// This function is called from the main command processor when the user
// wishes to change the scaling for channel 1.
//
// \return Returns \b true if a display update is required, \b false if not.
//
//*****************************************************************************
tBoolean
ChangeChannel1Pos(unsigned long ulPos)
{
    //
    // Update the global scaling information.
    //
    g_sRender.lVerticalOffsetmV[CHANNEL_1] = (long)ulPos;

    //
    // Pass the new scale back to the USB host, if connected.
    //
    ScopeUSBDeviceSendPacket(SCOPE_PKT_POSITION, SCOPE_CHANNEL_1, ulPos);

    //
    // A display update is needed.
    //
    return(true);
}

//*****************************************************************************
//
// Changes the vertical offset (mV) for channel 2.
//
// \param ulScale is the desired vertical scaling for channel 2 expressed
// in millivolts per division.
//
// This function is called from the main command processor when the user
// wishes to change the scaling for channel 2.
//
// \return Returns \b true if a display update is required, \b false if not.
//
//*****************************************************************************
tBoolean
ChangeChannel2Pos(unsigned long ulPos)
{
    //
    // Update the global scaling information.
    //
    g_sRender.lVerticalOffsetmV[CHANNEL_2] = (long)ulPos;

    //
    // Pass the new scale back to the USB host, if connected.
    //
    ScopeUSBDeviceSendPacket(SCOPE_PKT_POSITION, SCOPE_CHANNEL_2, ulPos);

    //
    // A display update is needed.
    //
    return(true);
}

//*****************************************************************************
//
// Saves the latest captured data as a bitmap or CSV file.
//
// \param ulType indicates the file format to save.
//
// This function is called from the main command processor when the user
// wishes to save a file containing the current waveform data.  Files are
// saved on an installed microSD card.  If \e ulType is SCOPE_SAVE_BMP, a
// Windows bitmap file of the current waveform display is saved.  If
// \e ulType is SCOPE_SAVE_CSV then a comma separated value file suitable
// for use with spreadsheets is saved.
//
// \return Returns \b false to indicate that no display update is needed.
//
//*****************************************************************************
tBoolean
SaveFile(unsigned long ulType)
{
    tBoolean bRetcode;
    tDataAcqCaptureStatus sStatus;

    //
    // Determine the status of the last capture.
    //
    bRetcode = DataAcquisitionGetStatus(&sStatus);
    if(!bRetcode)
    {
        UARTprintf("Error reading status!\n");
        return(false);
    }

    //
    // If there was an error while the data was being captured or if there
    // is not data actually captured yet, defer the file save operation until
    // there is data available.
    //
    if(sStatus.eState != DATA_ACQ_COMPLETE)
    {
        //
        // Reschedule the save command until later.
        //
        COMMAND_FLAG_WRITE(SCOPE_SAVE, ulType);
        return(false);
    }

    //
    // At this point, we have good data so go ahead and save it.  First
    // determine from the parameter which format is being requested.
    //
    if((ulType & SCOPE_SAVE_FORMAT_MASK) == SCOPE_SAVE_BMP)
    {
        //
        // Save a bitmap.  Extract the destination from the parameter and
        // call the File module to save the information to the relevant disk.
        //
        FileWriteBitmap(&sStatus,
                        ((ulType & SCOPE_SAVE_DRIVE_MASK) == SCOPE_SAVE_SD));
    }
    else
    {
        //
        // Save a CSV file.  Extract the destination from the parameter and
        // call the File module to save the information to the relevant disk.
        //
        FileWriteCSV(&sStatus,
                     ((ulType & SCOPE_SAVE_DRIVE_MASK) == SCOPE_SAVE_SD));
    }

    //
    // No redraw necessary.
    //
    return(false);
}

//*****************************************************************************
//
// Retransmits the latest captured waveform data to the USB host.
//
// \param ulParam is ignored.
//
// This function is called from the main command processor in response to
// an incoming USB request to retransmit the last captured waveform data
// set.
//
// \return Returns \b false to indicate that no display update is needed.
//
//*****************************************************************************
tBoolean
RetransmitData(unsigned long ulParam)
{
    tDataAcqCaptureStatus sCapInfo;
    tBoolean bRetcode;

    //
    // Get the current capture information from the data acquisition
    // module.
    //
    bRetcode = DataAcquisitionGetStatus(&sCapInfo);

    //
    // Ask the USB layer to retransmit the current data set assuming it
    // is complete and does not indicate any errors.
    //
    if(bRetcode && (sCapInfo.eState == DATA_ACQ_COMPLETE))
    {
        ScopeUSBDeviceSendData(&sCapInfo, false);
    }
    else
    {
        //
        // If we couldn't retransmit the current data, set our command
        // flag so that we try again next capture.
        //
        COMMAND_FLAG_WRITE(SCOPE_RETRANSMIT, 0);
    }

    //
    //
    // Indicate to the caller that no display update is required.
    //
    return(false);
}

//*****************************************************************************
//
// Sets the channel that is to be used for capture triggering.
//
// \param ulChannel is either CHANNEL_1 or CHANNEL_2.
//
// This function is called from the main command processor to set the
// trigger channel for the oscilloscope.
//
// \return Returns \b false to indicate that no display update is needed.
//
//*****************************************************************************
tBoolean
ChangeTriggerChannel(unsigned long ulChannel)
{
    tTriggerType eType;
    unsigned long ulTrigPos;
    unsigned short usLevel;
    unsigned long ulTrigType;

    //
    // We can only set the trigger on a channel which is currently
    // active so check for this.
    //
    if(!g_pbActiveChannels[ulChannel])
    {
        //
        // Update the menu in case this command came from there.
        //
        g_ulCommandParam[SCOPE_SET_TRIGGER_CH] =
                (ulChannel == CHANNEL_2) ? CHANNEL_1 : CHANNEL_2;
        MenuRefresh();
    }
    else
    {
        //
        // Tell the data acquisition module which channel to trigger on.
        //
        DataAcquisitionSetTriggerChannel((ulChannel == CHANNEL_1) ?
                                          true : false);
    }

    //
    // Get the existing trigger parameters.
    //
    DataAcquisitionGetTrigger(&eType, &ulTrigPos, &usLevel);

    //
    // Map from the internal trigger type enum to the values used in the
    // USB protocol.
    //
    switch(eType)
    {
        case TRIGGER_RISING:
        {
            ulTrigType = SCOPE_TRIGGER_TYPE_RISING;
            break;
        }

        case TRIGGER_FALLING:
        {
            ulTrigType = SCOPE_TRIGGER_TYPE_FALLING;
            break;
        }

        case TRIGGER_LEVEL:
        {
            ulTrigType = SCOPE_TRIGGER_TYPE_LEVEL;
            break;
        }

        case TRIGGER_ALWAYS:
        default:
        {
            ulTrigType = SCOPE_TRIGGER_TYPE_ALWAYS;
            break;
        }
    }

    //
    // Inform the USB host (if connected) that the trigger type has changed.
    //
    ScopeUSBDeviceSendPacket(SCOPE_PKT_TRIGGER_TYPE, (ulChannel == CHANNEL_1 ?
                             SCOPE_CHANNEL_1 : SCOPE_CHANNEL_2), ulTrigType);

    //
    // Indicate to the caller that no display update is required.
    //
    return(false);
}

//*****************************************************************************
//
// Displays an alert message to the user indicating that the USB host
// has connected.
//
// \param ulParam - ignored.
//
// This function is called from the main command processor when the USB
// host connects.
//
// \return Returns \b false to indicate that no display update is needed.
//
//*****************************************************************************
tBoolean
USBHostConnected(unsigned long ulParam)
{
    RendererSetAlert("USB host\nconnected.", 200);
    return(false);
}

//*****************************************************************************
//
// Displays an alert message to the user indicating that the USB host has
// been disconnected.
//
// \param ulParam - ignored.
//
// This function is called from the main command processor when the USB
// host disconnects.
//
// \return Returns \b false to indicate that no display update is needed.
//
//*****************************************************************************
tBoolean
USBHostDisconnected(unsigned long ulParam)
{
    RendererSetAlert("USB host\ndisconnected.", 200);
    return(false);
}

//*****************************************************************************
//
// Automatically adjusts the vertical offset and scale for the given channel
// to ensure that its waveform is visible on the display.
//
// \param ulChannel is either CHANNEL_1 or CHANNEL_2.
//
// This function is called from the main command processor when the user
// requests a "Find" operation either via the user interface or USB.
//
// \return Returns \b false to indicate that no display update is needed
// (since this function merely posts two other commands to set the scale and
// position for the channel).
//
//*****************************************************************************
tBoolean
FindChannel(unsigned long ulChannel)
{
    long lPos;
    unsigned long ulAmplitudemV;
    unsigned long ulScalemV;

    //
    // Pull the average value of the last captured waveform to the
    // center of the display be adjusting the vertical offset.  Round
    // to the nearest 100mV to keep the offset a multiple of 100.
    //
    lPos = -g_sMeasure.sInfo[ulChannel].lMeanmV;
    lPos = (lPos / 100) * 100;

    //
    // Set the vertical scaling so that the signal fits into the
    // display.  Only particular scale factors are allowed so we need
    // to find the next higher supported value after calculating our
    // desired scale.
    //
    ulAmplitudemV = (g_sMeasure.sInfo[ulChannel].lMaxmV -
                     g_sMeasure.sInfo[ulChannel].lMinmV);

    //
    // Scale the waveform so that, peak to peak, it is half the height
    // of the waveform area
    //
    ulScalemV = (ulAmplitudemV /
                 (WAVEFORM_HEIGHT / (GRATICULE_SIDE * 2)));

    //
    // Map the calculated scale to the closest supported scaling
    // value.
    //
    ulScalemV = ClosestSupportedScaleFactor(ulScalemV);

    //
    // Tell the main loop to update the vertical scaling and
    // offset to bring the waveform into view.  We don't call for an
    // immediate redraw since this will be done when the command flag
    // is processed in the main loop.
    //
    COMMAND_FLAG_WRITE(((ulChannel == CHANNEL_1) ? SCOPE_CH1_SCALE :
                        SCOPE_CH2_SCALE), ulScalemV);
    COMMAND_FLAG_WRITE(((ulChannel == CHANNEL_1) ? SCOPE_CH1_POS :
                        SCOPE_CH2_POS), (unsigned long)lPos);
    return(false);
}

//*****************************************************************************
//
// Sets the application to act as either a USB device or USB MSC host.
//
// \param ulMode is either 0 (for device mode) or 1 (for host mode).
//
// This function is called from the main command processor when the user
// changes the USB mode from the menu.  If the mode has changed, it will
// shut down USB and reconfigure for the new mode.
//
// \return Returns \b false to indicate that no display update is needed.
//
//*****************************************************************************
tBoolean
USBSetMode(unsigned long ulParam)
{
    tBoolean bRetcode;

    //
    // Are we changing from host to device?
    //
    if(g_bUSBModeIsHost && !ulParam)
    {
        //
        // Shut down USB host operation.
        //
        ScopeUSBHostTerm();

        //
        // Start up USB host operation.
        //
        bRetcode = ScopeUSBDeviceInit();

        //
        // Did things go as planned?
        //
        if(!bRetcode)
        {
            //
            // Dump an error to the UART if we failed to initialize.
            //
            UARTprintf("Unable to configure as a USB device!\n");
        }

        g_bUSBModeIsHost = false;
    }
    //
    // Are we changing from device to host?
    //
    else if(!g_bUSBModeIsHost && ulParam)
    {
        //
        // Shut down USB device operation.
        //
        ScopeUSBDeviceTerm();

        //
        // Start up USB host operation.
        //
        bRetcode = ScopeUSBHostInit();

        //
        // Did things go as planned?
        //
        if(!bRetcode)
        {
            //
            // Dump an error to the UART if we failed to initialize.
            //
            UARTprintf("Unable to configure as a USB host!\n");
        }

        //
        // Remember the mode we are in.
        //
        g_bUSBModeIsHost = true;
    }

    //
    // No display update is required as a result of this command.
    //
    return(false);
}

//*****************************************************************************
//
// Shows or hides the help screen.
//
// \param ulShow is 0 to hide the help screen or any other value to show
// it.
//
// This function is called from the main command processor when the user
// requests the help screen from the menu or when the help screen is
// dismissed.
//
// \return Returns \b false to indicate that no further screen redraw is
// required
//
//*****************************************************************************
tBoolean
ShowHelpScreen(unsigned long ulShow)
{
    //
    // If we are currently showing help and are being asked to hide it,
    // refresh the display.
    //
    g_bShowingHelp = (ulShow == 0) ? false : true;

    //
    // Show or hide the help information as required.
    //
    RendererDrawHelpScreen(g_bShowingHelp);

    //
    // No further screen redraw is needed.
    //
    return(false);
}

//*****************************************************************************
//
// Main entry function for the quickstart oscilloscope application.
//
// This is the main entry function for the quickstart oscilloscope
// application and holds system initialization code and the main application
// loop.
//
// \return None.
//
//*****************************************************************************
int
main(void)
{
    tBoolean bRetcode;

    //
    // Set the system clock to run at 50MHz from the PLL.
    //
    ROM_SysCtlClockSet(SYSCTL_SYSDIV_4 | SYSCTL_USE_PLL | SYSCTL_OSC_MAIN |
                       SYSCTL_XTAL_8MHZ);

    //
    // Set the system tick to fire 100 times per second.
    //
    ROM_SysTickPeriodSet(ROM_SysCtlClockGet() / SYSTICKS_PER_SECOND);
    ROM_SysTickIntEnable();
    ROM_SysTickEnable();

    //
    // Configure the relevant pins such that UART0 owns them.
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
    ROM_GPIOPinTypeUART(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);

    //
    // Open UART0 for debug output.
    //
    UARTStdioInit(0);

    //
    // Enable the uDMA controller and set up the control table base.
    //
    ROM_SysCtlPeripheralEnable(SYSCTL_PERIPH_UDMA);
    uDMAEnable();
    uDMAControlBaseSet(g_sDMAControlTable);

    //
    // Initialize the Class-D amplifier driver.
    //
    ClassDInit(SysCtlClockGet());

    //
    // Set default values for various parameters.
    //
    SetDefaultParameters();

    //
    // Initialize the SD card and file system.
    //
    bRetcode = FileInit();
    ERROR_CHECK(bRetcode, "ERROR! Can't initialize file system!\n");

    //
    // Initialize the pushbuttons.
    //
    ButtonsInit();

    //
    // Initialize the display.
    //
    RendererInit();

    //
    // Show the startup animation
    //
    RendererShowStartupScreen();

    //
    // Wait until the Class-D amplifier driver is done starting up.
    //
    while(ClassDBusy())
    {
    }

    //
    // Initialize the menu controls.
    //
    MenuInit();

    //
    // Initialize the USB library
    //
    //
    // Are we operating as a USB host or device?
    //
    if(g_bUSBModeIsHost)
    {
        //
        // Initialize as a host and start looking for a Mass Storage Class
        // device to be plugged in.
        //
        ScopeUSBHostInit();
    }
    else
    {
        //
        // Initialize as a device and publish our descriptors.
        //
        ScopeUSBDeviceInit();
    }

    //
    // Start up PWM0 to provide a square wave on the board TEST2 pin.
    //
    TestSignalInit();

    //
    // Initialize the data acquisition module.
    //
    bRetcode = DataAcquisitionInit();
    ERROR_CHECK(bRetcode, "ERROR! Can't initialize data acquisition!\n");

    //
    // Set the oscilloscope capture buffer.
    //
    bRetcode = DataAcquisitionSetCaptureBuffer(MAX_SAMPLES_PER_TRIGGER,
                                               g_usScopeData);
    ERROR_CHECK(bRetcode, "ERROR! Can't set channel buffer!\n");

    //
    // Set the default oscilloscope sample rate and triggering mode.  We set
    // the trigger position in the center of the data buffer and the level
    // at the 0 crossing point.  The trigger is set to ALWAYS initially to
    // ensure that we see something on the display regardless of the input
    // to channel 1.
    //
    ChangeTimebase(g_sRender.uluSPerDivision);
    bRetcode = DataAcquisitionSetTrigger(TRIGGER_ALWAYS,
                                  MAX_SAMPLES_PER_TRIGGER/2,
                                  MV_TO_ADC_SAMPLE(DEFAULT_TRIGGER_LEVEL_MV));
    ERROR_CHECK(bRetcode, "ERROR! Can't set trigger!\n");

    //
    // Default to triggering from channel 1.
    //
    bRetcode = DataAcquisitionSetTriggerChannel(true);
    ERROR_CHECK(bRetcode, "ERROR! Can't set trigger channel!\n");

    //
    // Set the interrupt priorities.  We set the GPIO used as the capture abort
    // handler as the highest priority, ADC as the next highest and set up
    // the priority grouping such that these interrupts will preempt all the
    // others.
    //
    IntPriorityGroupingSet(4);
    IntPrioritySet(INT_ADC0, ADC_INT_PRIORITY);
    IntPrioritySet(FAULT_SYSTICK, SYSTICK_INT_PRIORITY);
    IntPrioritySet(INT_UART0, UART_INT_PRIORITY);
    IntPrioritySet(ABORT_GPIO_INT, ABORT_INT_PRIORITY);
    IntPrioritySet(INT_PWM1, AUDIO_INT_PRIORITY);

    //
    // Print out a nice announcement heading.
    //
    UARTprintf("\nQuickstart Oscilloscope\n");
    UARTprintf("-----------------------\n\n");
    UARTprintf("Enter \"help\" for information on commands.\n\n");

    //
    // Request our first data capture.
    //
    g_bCapturePending = true;
    bRetcode = DataAcquisitionRequestCapture();

    //
    // Show the user prompt on the terminal
    //
    UARTprintf(">");

    //
    // Set an initial message giving the user a hint as to how to get
    // into the menu.
    //
    RendererSetAlert("Press Navigate to\nshow the menu.", 400);

    //
    // Now jump into the main loop.
    //
    while(1)
    {
        //
        // Is there currently a capture request outstanding?
        //
        if(g_bCapturePending)
        {
            //
            // Yes - check to see if the data has been captured.
            //
            if(DataAcquisitionIsComplete())
            {
                //
                // Capture has completed so get status and render the
                // waveform.  If no errors were seen, send the data back to
                // the USB host if connected.
                //
                UpdateWaveform(g_bMenuShown, g_bShowingHelp, true);

                //
                // We are no longer waiting for the capture to complete.
                //
               g_bCapturePending = false;
            }
        }

        //
        // Process any commands that we have been sent.
        //
        bRetcode = ProcessCommands(g_bCapturePending);

        //
        // Did any of the commands just processed require is to update the
        // waveform display?
        //
        if(bRetcode)
        {
            UpdateWaveform(g_bMenuShown, g_bShowingHelp, false);
        }

        //
        // If we are performing continuous capture and we don't have a
        // capture request pending, prime for the next capture assuming at
        // least CAPTURES_PER_SECOND ticks have elapsed since the last one.
        // This is to ensure that the UI has some time when capturing at the
        // highest sample rates.
        //
        if(!g_bCapturePending && !g_bMenuShown &&
           g_bContinuousCapture && (g_ulCaptureTick >= CAPTURES_PER_SECOND))
        {
            g_ulCaptureTick = 0;
            g_bCapturePending = true;
            DataAcquisitionRequestCapture();
        }
    }
}
